
Feature: Add comment
За да се ползва системата е необходимо всеки потребител
   първо да е влезнал в системата с предварително регистриран профил.

  Scenario: Добавяне на коментар с валидни данни
    Given Потребителя се намира в екрана на статията
    And Натиска бутон за добавяне на коментар
    And Отваря се попъп за добавяне на коментар
    When Въведе текст
    And Натисне бутон за поствсне
    Then Показва съобщение "Вашият коментар е успешно добавен"

  Scenario: Добавяне на коментар без данни
    Given Потребителя се намира в екрана на статията
    And Натиска бутон за добавяне на коментар 
    And Отваря се попъп за добавяне на коментар
    When Не въведе текст
    And Натисне бутон за поствсне
    Then Показва съобщение "Вашият коментар не е успешно добавен"

 Scenario: Добавяне на коментар с невалидни данни
    Given Потребителя се намира в екрана на статията
    And Натиска бутон за добавяне на коментар 
    And Отваря се попъп за добавяне на коментар
    When Въведе текст по-малко от два символа
    And Натисне бутон за поствсне
    Then Показва съобщение "Вашият коментар не е успешно добавен"
 